{"Title":"Nature Under Constraint and Vexed","Year":"2014","Rated":"TV-14","Released":"19 Apr 2014","Season":"2","Episode":"1","Runtime":"44 min","Genre":"Action, Drama, Sci-Fi","Director":"John Fawcett","Writer":"John Fawcett (created by), Graeme Manson (created by), Graeme Manson, Tony Elliott (executive story editor), Chris Roberts (story editor), Alexandra Mircheff (story coordinator), Anika Johnson (created and adapted for the screen by: Blood Ties), Barbara Johnston (created and adapted for the screen by: Blood Ties), Elize Morgan (developed with the participation of: Canadian Film Centre story editor resident), Peter Rowley (developed with the participation of: Canadian Film Centre story editor resident), Andrew De Angelis (developed with the participation of: Canadian Film Centre story editor resident), Kim Coghill (developed with the participation of: Canadian Film Centre story editor resident), Jeff Detsky (developed with the participation of: Canadian Film Centre story editor resident), Adam Higgs (developed with the participation of: Canadian Film Centre story editor resident), Alex Levine (developed with the participation of: Canadian Film Centre story editor resident), Rebecca Sernasie (developed with the participation of: Canadian Film Centre story editor resident), Bob Mackowycz Jr. (developed with the participation of: Canadian Film Centre story editor resident)","Actors":"Tatiana Maslany, Dylan Bruce, Jordan Gavaris, Kevin Hanchard","Plot":"Rachel has kidnapped Kira and Mrs. S. While trying to elude Rachel's thugs herself, Sarah has to decide whether to trust Paul as the person who has the best access to Rachel of those she ...","Language":"English, German, Mandarin","Country":"Canada","Awards":"N/A","Poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3ODk1NTQzOF5BMl5BanBnXkFtZTgwNTg4NDQ2MTE@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"8.7/10"}],"Metascore":"N/A","imdbRating":"8.7","imdbVotes":"1329","imdbID":"tt2922240","seriesID":"tt2234222","Type":"episode","Response":"True"}