{"Title":"Mingling Its Own Nature with It","Year":"2014","Rated":"TV-14","Released":"03 May 2014","Season":"2","Episode":"3","Runtime":"44 min","Genre":"Action, Drama, Sci-Fi","Director":"T.J. Scott","Writer":"John Fawcett (created by), Graeme Manson (created by), Alex Levine, Tony Elliott (executive story editor), Chris Roberts (story editor), Alexandra Mircheff (story coordinator), Anika Johnson (created and adapted for the screen by: Blood Ties), Barbara Johnston (created and adapted for the screen by: Blood Ties), Elize Morgan (developed with the participation of: Canadian Film Centre story editor resident), Peter Rowley (developed with the participation of: Canadian Film Centre story editor resident), Andrew De Angelis (developed with the participation of: Canadian Film Centre story editor resident), Kim Coghill (developed with the participation of: Canadian Film Centre story editor resident), Jeff Detsky (developed with the participation of: Canadian Film Centre story editor resident), Adam Higgs (developed with the participation of: Canadian Film Centre story editor resident), Alex Levine (developed with the participation of: Canadian Film Centre story editor resident), Rebecca Sernasie (developed with the participation of: Canadian Film Centre story editor resident), Bob Mackowycz Jr. (developed with the participation of: Canadian Film Centre story editor resident)","Actors":"Tatiana Maslany, Dylan Bruce, Jordan Gavaris, Kevin Hanchard","Plot":"Sarah is able to escape with Kira from the bird watchers and Mrs. S, and now, along with Felix, are on the run with no money. They decide to take refuge at a secluded house where the owner ...","Language":"English","Country":"Canada","Awards":"N/A","Poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUwNTQ4MTkyMF5BMl5BanBnXkFtZTgwOTcyODI3MTE@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"8.4/10"}],"Metascore":"N/A","imdbRating":"8.4","imdbVotes":"1084","imdbID":"tt3314576","seriesID":"tt2234222","Type":"episode","Response":"True"}